Revit 2027 API
DWFImportOptions.GetSheetViews Method
 Get sheet views where DWF markups are imported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetSheetViews()
Public Function GetSheetViews As IList(Of ElementId)
public:
IList<ElementId^>^ GetSheetViews()
member GetSheetViews : unit -> IList<ElementId>
Return Value
IList<ElementId>
 An array of sheet views
See Also
Reference
DWFImportOptions Class
Autodesk.Revit.DB Namespace